Tekla Open API Reference for Tekla Structures 2025
DPMPrinterAttributes.NumberOfCopies Property
 The number of copies of each drawing to print. Only applicable for printing to a printer.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int NumberOfCopies { get; set; }
Public Property NumberOfCopies As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DPMPrinterAttributes Class
Tekla.Structures.Drawing Namespace